{
  "backend/main.mo": "Actor includes MixinStorage for blob storage functionality.",
  "feature_evidence.json": "Defines feature evidence entries linking OG image deployment requirements to related files and components.",
  "frontend-file-summaries.txt": "Contains textual summaries of multiple frontend source files for build reference.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables and dark/light theme foundations.",
  "frontend/index.html": "Main HTML template including OG/Twitter metadata pointing to ogcard.jpg and loading the React app.",
  "frontend/OG_PREVIEW_VERIFICATION.md": "Documentation explaining how to verify OG/Twitter preview functionality and troubleshoot image accessibility issues.",
  "frontend/public/.ic-assets.json5": "Asset canister rules ensuring ogcard.jpg is uploaded with correct headers and caching.",
  "frontend/public/.well-known/ic-domains": "Lists verified domains for IC boundary node domain validation.",
  "frontend/public/.well-known/ii-alternative-origins": "Declares alternative origins for Internet Identity compatibility.",
  "frontend/src/App.tsx": "Root React component enabling dark mode and rendering LandingPage within an error boundary.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a fallback UI with reload option.",
  "frontend/src/components/InteractiveBackground.tsx": "Canvas-based interactive background rendering a cursor‑reactive mesh with fade and movement effects.",
  "frontend/src/components/PersonalModeContent.tsx": "Scroll-driven personal-mode section with background preloading, section fade-ins, and a carousel hint animation; renders project cards and manages UI state.",
  "frontend/src/components/ProfessionalModeContent.tsx": "Professional-mode view with background loading, scroll-triggered animations, expandable sections, and sequential reveal of timeline, experience, ecosystem, and tool items.",
  "frontend/src/components/ProjectCard.tsx": "Reusable project card with thumbnail, modal overlay, image carousel scrolling, and YouTube embed handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored-identity loading, and AuthClient configuration.",
  "frontend/src/hooks/useModeSelectorRemeasure.ts": "Hook that increments a counter on window or element resize to trigger layout recalculations.",
  "frontend/src/hooks/useQueries.ts": "Placeholder React Query hook wired to the actor, ready for future backend queries.",
  "frontend/src/index.css": "Tailwind base configuration plus theme variables, dark mode settings, and custom UI styles for mode selectors and global elements.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider before rendering App.",
  "frontend/src/pages/LandingPage.tsx": "Implements the animated landing screen with mode selection, media preloading, audio/tap feedback, and state-driven transitions for personal/professional views.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme tokens, colors, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Metadata describing the project’s current features, versions, and high-level summary of the portfolio app’s UX and infrastructure."
}