{
  "backend/main.mo": "Actor that mixes in blob storage capabilities using MixinStorage.",
  "feature_evidence.json": "Feature evidence report listing OG image update tasks, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "High-level summaries of all major frontend source files and their responsibilities.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables and dark theme behavior.",
  "frontend/index.html": "HTML entry file defining metadata, OG/Twitter tags, favicons, and main script mount.",
  "frontend/OG_PREVIEW_VERIFICATION.md": "Instructions for verifying OG/Twitter previews and troubleshooting OG image issues.",
  "frontend/public/.ic-assets.json5": "Asset canister rules specifying headers and caching for OG images and other public files.",
  "frontend/public/.well-known/ic-domains": "Domain list for IC canister domain configuration.",
  "frontend/public/.well-known/ii-alternative-origins": "Defines alternative origins for Internet Identity authentication.",
  "frontend/public/site.webmanifest": "Web app manifest describing icons, theme, and PWA metadata.",
  "frontend/src/App.tsx": "Main React app component applying dark theme and rendering the LandingPage inside an error boundary.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches render/runtime errors and provides a reload option.",
  "frontend/src/components/InteractiveBackground.tsx": "Canvas-based background that generates and animates a responsive mesh reacting to mouse and touch input.",
  "frontend/src/components/PersonalModeContent.tsx": "Scrollable personal-mode page with lazy-loaded background, section fade-ins, and a carousel hint triggered by intersection observers.",
  "frontend/src/components/ProfessionalModeContent.tsx": "Professional-mode page handling scroll-triggered animations, background preload, timeline effects, and interactive role/ecosystem sections.",
  "frontend/src/components/ProjectCard.tsx": "Clickable project card that opens a detailed overlay with text, images, links, and an optional YouTube embed plus a horizontal image carousel.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login state, and persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useModeSelectorRemeasure.ts": "Hook that increments a counter when window or element sizes change, enabling components to remeasure layouts.",
  "frontend/src/hooks/useQueries.ts": "Placeholder query hook that waits for the actor and provides space for future backend queries.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH CSS variables plus custom styles and animations for mode selectors and base UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/LandingPage.tsx": "Implements the animated landing page with mode switching, image preloading, audio feedback, and timed transitions.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, extended theming, animations, and plugins.",
  "project_state.json": "Tracks project metadata, issues, and feature requests related to fixing and updating OG image assets."
}