{
  "backend/main.mo": "Actor includes blob storage mixin for handling stored assets.",
  "feature_evidence.json": "Feature evidence report detailing OG image update, metadata changes, asset rules, and verification requirements.",
  "frontend-file-summaries.txt": "Collection of short summaries for various frontend source files describing components, hooks, and styling behaviors.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH theme variables, dark mode tokens, and base element styling.",
  "frontend/index.html": "Main HTML template including canonical URL, updated OG/Twitter metadata, favicons, and app entry point.",
  "frontend/OG_PREVIEW_VERIFICATION.md": "Guide for validating social media OG/Twitter previews and troubleshooting OG image deployment issues.",
  "frontend/public/.ic-assets.json5": "Asset canister rules explicitly including ogcard-v2.jpg with correct headers and caching settings.",
  "frontend/public/.well-known/ic-domains": "Lists allowed domains for IC.",
  "frontend/public/.well-known/ii-alternative-origins": "Defines alternative origins for Internet Identity.",
  "frontend/public/site.webmanifest": "Web app manifest defining app name, icons, and theme settings.",
  "frontend/src/App.tsx": "Root React component applying dark theme and rendering LandingPage within an error boundary.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches render errors and displays a fallback UI with reload option.",
  "frontend/src/components/InteractiveBackground.tsx": "Canvas-based interactive mesh that reacts to cursor movement and resizes dynamically.",
  "frontend/src/components/PersonalModeContent.tsx": "Scroll-driven personal profile layout with section fade-ins, carousel hint animation, and background preloading.",
  "frontend/src/components/ProfessionalModeContent.tsx": "Professional profile view with scroll-triggered animations for timelines, experience, tools, and background image preload.",
  "frontend/src/components/ProjectCard.tsx": "Clickable project card that opens a detailed overlay with images, YouTube embedding, and carousel scrolling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and exposing login, logout, and status state.",
  "frontend/src/hooks/useModeSelectorRemeasure.ts": "Tracks layout changes via resize events and observers, returning a counter to trigger recalculations.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook demonstrating how to run backend queries using the actor with react-query.",
  "frontend/src/index.css": "Defines Tailwind layers, OKLCH theme variables, global styles, and custom animations/interactions for mode selector elements.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/LandingPage.tsx": "Implements the interactive landing page with mode transitions, preloading images, audio feedback, and animated UI state handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color variables, animations, container settings, and plugin integrations.",
  "project_state.json": "Tracks project metadata and requirements focused on fixing OG/Twitter card caching via versioned OG images and updated meta tags."
}