{
  "kind": "build_request",
  "title": "Fix PERSONAL/PROFESSIONAL mode selector active border/underline width clipping",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the PERSONAL and PROFESSIONAL mode selector text-link styling so that in the selected/active state (when the label becomes bold), the border/underline correctly spans the full rendered text width (including the bolded glyph width) exactly as it does on hover, without changing any existing transitions, timings, animations, or overall visual design.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "On hover, the button/pill border expands correctly and wraps the full text. But on click / selected / active state, the border width is too small (it doesn’t cover the full bold word)"
        ]
      },
      "acceptanceCriteria": [
        "When PERSONAL is active, the border/underline spans the full width of the bold “PERSONAL” text with no clipping or shortfall.",
        "When PROFESSIONAL is active, the border/underline spans the full width of the bold “PROFESSIONAL” text with no clipping or shortfall.",
        "Hover behavior remains visually identical to current behavior (same animation/transition behavior and appearance).",
        "No transition properties (durations/easings/delays) are modified for the mode selector elements."
      ]
    }
  ],
  "constraints": [
    "Do not modify or remove any existing transitions, animations, timings, or interaction design for the mode selector UI (PERSONAL/PROFESSIONAL).",
    "Limit changes to the minimal CSS/class adjustments necessary to resolve the active-state sizing issue."
  ],
  "nonGoals": [
    "Redesigning the mode selector UI (colors, shapes, typography choices, hover effects).",
    "Changing mode switching logic or any landing page transition behavior.",
    "Addressing unrelated known issues (e.g., duplicated index.css tokens, InteractiveBackground distance=0 guard, Download CV stub)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}