{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 11,
  "summary": "A dark-themed, highly animated React/Tailwind portfolio landing page for “Prabhat Chhirolya” with an interactive landing background and two content modes (Personal / Professional). The frontend includes rich scroll-triggered section animations, horizontal carousels, and modal project deep-dives (images + YouTube embeds), plus mode-specific social links. The codebase also includes an Internet Computer (ICP) backend Motoko canister providing a Caffeine/IC storage-operations mixin (gateway authorization refresh, dead-blob pruning confirmation + forced GC, blob liveness checks, and cycles refill/top-up plumbing), alongside a generalized build/deploy template and reusable frontend UI component scaffolding (shadcn-ui) for repeatable ICP app packaging.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Mode-based landing page (initial / personal / professional) with transitions",
      "synonyms": [
        "Mode selector navigation",
        "Three-state landing flow"
      ],
      "description": "Implements a landing experience with three modes. The top selector buttons switch between Personal and Professional content; returning home is done by clicking the name. Mode changes coordinate fade-out/fade-in, delayed content mounting, and animated layout changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Interactive landing background (cursor/touch reactive mesh + overlay)",
      "synonyms": [
        "Canvas mesh background",
        "InteractiveBackground"
      ],
      "description": "Renders a performance-optimized canvas point mesh (25px spacing) that brightens and subtly moves toward the cursor/touch, plus a radial dark overlay that locally fades around the interaction point. Only visible in the initial landing state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Unified identity group and profile-picture morphing animation",
      "synonyms": [
        "Profile morph to mode buttons",
        "Identity group container"
      ],
      "description": "Displays a single identity group (profile image + name + role line) that changes scale/position between the initial center state and the mode state. Profile image can morph to the selected mode button position using measured DOM rects for smooth spatial continuity.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Personal mode content (scrollable sections + projects + expandable beliefs)",
      "synonyms": [
        "PersonalModeContent",
        "Personal Journey page"
      ],
      "description": "Provides a scrollable Personal Journey view with background preloading and a branded dark overlay. Includes sections for thoughts, curiosities, a horizontal carousel of personal projects (with hint animation), a personal note, and an expandable “Personal Beliefs & Interests” section.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Professional mode content (timeline, experience, skills, tools, ecosystem, projects)",
      "synonyms": [
        "ProfessionalModeContent",
        "Professional Work page"
      ],
      "description": "Provides a scrollable Professional Work view with background preloading, a work-philosophy carousel, an animated timeline with vector backgrounds, a capabilities grid, interactive work experience cards with expandable achievements, selected professional projects carousel, work approach statements, tool clusters with hover effects, and expandable ecosystem fluency categories.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Project detail modal with carousel, YouTube embed, and links",
      "synonyms": [
        "ProjectCard overlay",
        "Project modal"
      ],
      "description": "ProjectCard renders a clickable card opening a full-screen modal with dimming backdrop, scrollable content, paragraphs, optional responsive YouTube embed, horizontally scrollable image carousel with navigation buttons, optional live project link, and arbitrary external links. Supports extra metadata for professional projects (role/tools/results).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Mode-aware footer social links",
      "synonyms": [
        "Dynamic social icons",
        "Footer links"
      ],
      "description": "Footer renders different sets of social icons depending on the active mode (e.g., Instagram for personal; LinkedIn/GitHub for professional), with hover scaling and proper external-link behavior.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Tap feedback: audio + haptics + micro-motion animation",
      "synonyms": [
        "Mode selection feedback",
        "Tap sound + vibrate"
      ],
      "description": "On mode selection, plays a subtle tap sound and triggers mobile vibration when available. Also adds a micro-motion CSS animation class to the tapped mode button for tactile feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Image preloading and branded overlay backgrounds",
      "synonyms": [
        "Background preload",
        "Mode entry backgrounds"
      ],
      "description": "Preloads key images (landing background and profile photo; per-mode entry backgrounds) and applies fade-in/opacity transitions. Personal/Professional modes include branded dark gradient overlays atop background images for readability and consistent mood.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Scroll-triggered reveal animations and sequential section/item entrances",
      "synonyms": [
        "Section fade-in",
        "Timeline/work/tools/ecosystem animations"
      ],
      "description": "Implements scroll-based detection to add CSS classes that reveal sections. Timeline items, work experience blocks, ecosystem entries, and tool pills animate in sequentially using index-based delays for a guided storytelling effect.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Internet Identity authentication provider (login/logout + persisted identity)",
      "synonyms": [
        "InternetIdentityProvider",
        "II auth context"
      ],
      "description": "Provides a React context wrapper for Internet Identity using @dfinity/auth-client, supporting login/logout, delegation validity checks, configurable derivation origin, and loading any stored authenticated identity on mount.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "ICP actor creation and React Query integration",
      "synonyms": [
        "useActor hook",
        "Actor lifecycle management"
      ],
      "description": "Creates an ICP canister actor either anonymously or with the authenticated identity, keyed by principal in React Query. On actor changes, it invalidates and refetches dependent queries to keep data consistent across login state changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Backend storage operations mixin (authorization refresh, dead-blob pruning, cycles refill)",
      "synonyms": [
        "Motoko storage mixin",
        "Caffeine storage admin endpoints"
      ],
      "description": "Motoko backend actor includes a storage mixin exposing endpoints to: refresh authorized gateway principals by calling a cashier canister; check if a blob is live; retrieve dead blobs to delete (authorized only); confirm blob deletion and force GC; refill/top-up cashier with cycles; and return a placeholder upload certificate response.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Reusable ICP app build/deploy template (monorepo scaffolding + scripts)",
      "synonyms": [
        "build-template",
        "ICP packaging template",
        "deploy tooling"
      ],
      "description": "Adds a reusable build template with Dockerfile, deploy script, ICP YAML/canister config scaffolding, workspace package management, and helper scripts (e.g., image pruning/resizing) to standardize building and deploying the app/canisters.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Reusable shadcn-ui component library scaffold integrated into the frontend template",
      "synonyms": [
        "shadcn-ui",
        "UI component scaffold",
        "template UI kit"
      ],
      "description": "Introduces a large set of prebuilt shadcn-ui React components (buttons, dialogs, accordions, forms, etc.) plus supporting config (utils, hooks, Tailwind/PostCSS/Vite config) as part of the frontend build template for consistent UI construction.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-fix-the-personal-and-professional-mode-selector-text-link-styling-so-that-in-the-selected-active-state-when-the-label-becomes-bold-the-border-underline-correctly-spans-the-full-rendered-text-width-including-the-bolded-glyph-width-exactly-as-it-does-on-hover-without-changing-any-existing-transitions-timings-animations-or-overall-visual-design",
      "title": "Fix the PERSONAL and PROFESSIONAL mode selector text-link styling so that in the selected/active state (when the label becomes bold), the border/underline correctly spans the full rendered text width (including the bolded glyph width) exactly as it does on hover, without changing any existing transitions, timings, animations, or overall visual design.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [],
  "architecturalNotes": [
    "Frontend is a React SPA with component-driven UI (LandingPage orchestrates modes; PersonalModeContent/ProfessionalModeContent are scrollable sub-pages; ProjectCard provides reusable modal/details UI).",
    "Styling uses Tailwind CSS with a custom OKLCH token system and extensive bespoke CSS animations for micro-interactions and scroll reveals.",
    "Dark theme is enforced via next-themes ThemeProvider (forcedTheme=\"dark\").",
    "State-driven page transitions: mode changes trigger coordinated fade-out/fade-in and profile-picture morphing based on DOM measurements of the mode buttons.",
    "Interactive background implemented with a canvas-rendered point mesh + CSS radial-gradient overlay that tracks mouse/touch, only enabled in the initial landing state.",
    "Data layer uses @tanstack/react-query with a custom useActor hook that creates an ICP canister actor (anonymous or authenticated) and invalidates dependent queries on identity change.",
    "Authentication uses Internet Identity via @dfinity/auth-client wrapped in a context provider (InternetIdentityProvider) with login/logout and delegation validity checks.",
    "Backend is Motoko with an actor composed via include MixinStorage(); mixin exposes storage operations leveraging Prim system APIs (dead blob discovery/pruning, blob liveness, cycles balance/send).",
    "Repository now includes a reusable build-template workspace for ICP apps (Dockerfile, deploy.sh, icp.yaml, workspace package manifests, and scripts for asset/image maintenance).",
    "Build-template frontend includes a shadcn-ui component scaffold with accompanying Tailwind/Vite/TypeScript configuration and shared utility modules.",
    "Custom ESLint rules were added in the build-template frontend to enforce project conventions (e.g., Internet Identity provider usage, query-key constraints)."
  ],
  "knownIssues": [
    "frontend/index.css appears duplicated with conflicting :root tokens (one light-root/dark override version and one dark-root version). This can cause unpredictable styling depending on bundler/import resolution.",
    "ProfessionalModeContent “Download CV” button is a stub (console.log only) and does not actually download a PDF.",
    "frontend/src/hooks/useQueries.ts is explicitly a placeholder; no real backend queries are implemented yet.",
    "InteractiveBackground: when cursor is exactly on a mesh point, distance can be 0 and (dx / distance) will yield Infinity/NaN, potentially causing rendering artifacts (should guard distance === 0).",
    "Scroll-triggered sequential animations use setTimeout per scroll without cancellation; repeated scrolling can queue multiple timeouts and re-add classes redundantly (minor perf/behavior risk).",
    "LandingPage sets backgroundAttachment: 'fixed' on the background; this can be problematic on some mobile browsers (jank/ignored fixed backgrounds).",
    "Backend Storage state (authorizedPrincipals) is transient (not stable); it will reset on canister upgrade/reinstall unless persisted elsewhere.",
    "Storage.refillCashier uses Nat.sub(currentBalance, reservedCycles) which may trap if currentBalance < reservedCycles; should clamp at 0 before subtraction.",
    "Backend certificate creation endpoint (_caffeineStorageCreateCertificate) returns a static structure and does not actually create/validate an upload certificate (appears placeholder).",
    "Backend depends on env var CAFFFEINE_STORAGE_CASHIER_PRINCIPAL; missing configuration will trap at runtime.",
    "Mode selector (PERSONAL/PROFESSIONAL) pill border sizing bug: on hover the border expands to wrap full text, but in active/selected (bold) state the border width is too small/clipped, suggesting fixed width or missing padding in active state. Needs fix without altering transitions/design."
  ],
  "isFixRequest": true,
  "generatedImages": [],
  "gameProjectType": "none",
  "projectName": "Prabhat Chhirolya Portfolio Landing Page",
  "clarification_mode": "instant",
  "clarification_rounds": 0,
  "requiresBackendChanges": false,
  "requiresFrontendChanges": true
}